import React, { useState } from "react";
import AskText from "./askText";
import numberImg from "../../assets/img/number_end.jpeg";
import style from "./style/style.module.scss";
import AskImg from "./askImg";
import { Fade, Roll } from "react-awesome-reveal";

const AskQuestion: React.FC = () => {
  const [ask] = useState([
    {
      title: "ЗАПРАВКА КОНДИЦІОНЕРА АВТО У КРОПИВНИЦЬКОМУ",
      text: "Кондиціонер в автомобілі - це незмінна зручність у всі пори року. В умовах жорсткої експлуатації, під час частої їзди у спеку чи мороз, система кондиціювання піддається вагомому навантаженню. Якщо ви часто користуєтесь кондиціонером, або ваше авто тривалий час не використовувалося, заправка автокондиціонера має стати пріоритетним завданням у підготовці машини до весняно-літнього періоду. Наша мережа мобільних заправок автокондиціонерів допоможе виконати діагностику, підібрати оптимальний холодоагент під вашу модель, підвищити функціональність усієї системи кондиціювання.",
    },
    {
      title: "ЯК ДІЗНАТИСЯ, ЩО НЕОБХІДНА ТЕРМІнова заправка кондиціонера в авто",
      text: "Щоб виключити ймовірність поломки та уникнути проблем із системою кондиціювання, ми настійно рекомендуємо проводити діагностику, профілактичні заходи регулярно. За допомогою спеціального обладнання наші фахівці визначать нестачу холодоагенту щодо вимірювання тиску в контурі. Якщо витік у межах норми, то система функціонує нормально. А якщо ні, то великі втрати можуть бути наслідком серйозних поломок. Якщо ви помітили масляні плями або в салоні відчувається низька прохолода, слід негайно звернутися до професіоналів. Ми допоможемо усунути несправність вчасно, заправити кондиціонер у машині. Ціна та якість вас приємно порадують.",
    },
    {
      title: "У ЯКИХ ВИПАДКАХ ПРОВОДИТЬСЯ ЗАПРАВКА АВТОКОНДИЦІОНЕРІВ",
      text: "Якщо ви регулярно звертаєтеся до сервісу з метою діагностики системи кондиціювання, заправка кондиціонера на автомобіль здійснюватиметься планово. Для цього попередньо вимірюється рівень холодоагенту, і своєчасне його заповнення дозволить продовжити термін служби системи. Ця процедура проводиться і у випадку, коли було здійснено чищення або ремонт. Якщо спостерігається зношування деталей, необхідна їх заміна, перед початком робіт повністю видаляємо залишки холодоагенту. Такі ж маніпуляції проводяться і при антибактеріальному чищенні. Після виконання всіх робіт виконується повторне заправлення кондиціонера на авто.",
    },
    {
      title: "ЧТО ВЛИЯЕТ НА ЧАСТОТУ ЗАПРАВКИ АВТОМОБИЛЬНОГО КОНДИЦИОНЕРА",
      text: "Чому деякі кондиціонери заправляти потрібно частіше, ніж інші? На термін експлуатації впливає кілька факторів. Найчастіше - перепади температур, які спричиняють утворення тріщин на гумових елементах, втрату еластичності сальників. Заправити кондиціонер в авто в такому випадку потрібно раніше терміну через додатковий витік холодоагенту. Часто проблема може виникнути внаслідок впливу хімічних дорожніх реагентів чи вібрації. Фахівці нашого сервісу проведуть оцінку обсягу холодоагенту у системі. Якщо буде потрібно екстрене заправлення кондиціонера, ціна залежатиме від того, який холодоагент підходить саме вашій системі.",
    },
    {
      title: "ЗАПРАВКА КОНДИЦІОНЕРА: ПІДГОТУЙТЕ СВІЙ АВТОМОБІЛЬ ДО Спекотного СЕЗОНУ",
      text: "Незалежно від того, наскільки часто ви користуєтеся системою кондиціювання в салоні, її необхідно перевіряти щорічно. Заправка кондиціонера авто - швидше за плановий захід. Вона проводиться за умови повної справності системи приблизно раз на 3 – 4 роки. Якщо кондиціонер використовується не часто, відсоток витоку холодоагенту становить 15%. Якщо ви користуєтеся регулярно, заправити кондиціонер у машині доведеться раніше приблизно раз на рік. Визначити залишкову кількість холодоагенту допоможуть наші спеціалісти на автостанціях у Броварах, Києві, Борисполі.",
    },
    {
      title: "ЗАПРАВКА КОНДИЦІОНЕРА АВТО: ЦІНА, ШВИДКІСТЬ, ЯКІСТЬ - З НАМИ НАДІЙНО ЗАВЖДИ",
      text: "Комфортний клімат у салоні, відсутність шуму ззовні, чисте повітря – все це головні переваги використання автомобільного кондиціонера. Щоб він служив довго, безперебійно у звичайних та жорстких умовах експлуатації, ми пропонуємо комплексне обслуговування системи. З нами ви завжди будете впевнені у справності автокондиціонера, заправка буде здійснюватися своєчасно, і у разі зношування деталей вони будуть грамотно та своєчасно замінені. Заправка автомобільних кондиціонерів більше не завдасть вам клопоту, ми візьмемо їх на себе. Чекаємо на вас у будь-який час у Броварах, Києві, Борисполі. Цілих 7м мобільних станцій щодня протягом сезону будуть допомагати вам у вирішенні проблем зі спекою всередині вашого автомобіля.",
    },
  ]);

  return (
    <div className={style.ask_wprapper}>
      <Roll>
        <AskText ask={ask} />
      </Roll>
      <Fade direction="left">
        <AskImg numberImg={numberImg} />
      </Fade>
    </div>
  );
};

export default AskQuestion;
